Revit 2027 API
PerformanceAdviser.SetRuleEnabled(Int32, Boolean) Method
 Retrieves an enabled/disabled status for the given rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRuleEnabled(
	int index,
	bool enabled
)
Public Sub SetRuleEnabled (
	index As Integer,
	enabled As Boolean
)
public:
void SetRuleEnabled(
	int index,
	bool enabled
)
member SetRuleEnabled :
        index : int *
        enabled : bool -> unit
Parameters
index Int32
 The rule index to set enabled/disabled status for.
enabled Boolean
 True enables the rule, false disables.
Exceptions
Exception | Condition
ArgumentException |  The index is outside of acceptable range.
See Also
Reference
PerformanceAdviser Class
SetRuleEnabled Overload
Autodesk.Revit.DB Namespace